content/topics/relative_major_minor.md
+++
title = "Relative major and minor"
author = ["hermes"]
tags = ["music"]
draft = false
+++

## Overview {#overview}

Every major key has a **relative minor** — a minor key that shares exactly the same set of seven pitches (and therefore the same key signature) but has a different tonal centre. The relative minor is found by descending three semitones (a minor third) from the major root, or equivalently by starting the major scale on its sixth degree.

Conversely, every minor key has a relative major found three semitones above its root.


## The relationship {#the-relationship}

-   Ab major → relative minor: Fm (start Ab scale on 6th degree = F; or Ab − 3 semitones = F).
-   F minor → relative major: Ab major.
-   Bb minor → relative major: Db major.
-   Key signature of Ab major and F minor is identical: four flats (Bb, Eb, Ab, Db).


## Why it matters in practice {#why-it-matters-in-practice}

Because relative pairs share all pitches, they are maximally compatible for mixing and modulation. On the [Circle of fifths]({{< relref "circle_of_fifths.md" >}}), the relative minor sits on the inner ring directly adjacent to its major counterpart. On the Camelot wheel used in [Harmonic mixing]({{< relref "harmonic_mixing.md" >}}), switching between a key's A (minor) and B (major) position is one of the smoothest possible transitions — same number, different letter.


## Emotional contrast {#emotional-contrast}

Despite sharing all pitches, major and relative minor sound and feel very different because of the tonal centre:

-   Major: bright, stable, resolved.
-   Natural minor: dark, introspective, melancholic.
-   The same melodic material recontextualised over different tonal centres produces the emotional journey from tension to release — a structural device in DJ sets (see [DJ set arc]({{< relref "dj_set_arc.md" >}})).


## Enharmonic pivots {#enharmonic-pivots}

When a note functions differently in its minor context vs its major context, it becomes a compositional pivot. In the F minor → Ab major transition: the note G# (a tense chromatic note in F minor's melodic vocabulary) is enharmonically identical to Ab, the root of the resolution key. The same pitch resolves its own tension by becoming the new tonal centre.

See also: [Dorian mode]({{< relref "dorian_mode.md" >}}), [Circle of fifths]({{< relref "circle_of_fifths.md" >}}), [House music]({{< relref "house_music.md" >}}).


## Resources {#resources}

-   2026-06-07 ◦ [House Music: Melody, Bass Lines, and Harmony](~/repos/priv/roam-sources/articles/2026/2026-06-07_house-music-theory-melody-bass-harmony.md) — used F minor / Ab major as a relative pair to structure a 3-track set; the enharmonic G#/Ab pivot between Track 1 and Track 3 closes the emotional loop from chromatic tension to tonal resolution
